# LinkedResourceOpenedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkedResourceOpenedEventArgs Class
Members See Also
---
The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened].
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class LinkedResourceOpenedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class LinkedResourceOpenedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..LinkedResourceOpenedEventArgs
# See Also
LinkedResourceOpenedEventArgs Members
Autodesk.Revit.DB.Events Namespace